GopalSaraf/Practicals/PSDL/include/proc/pic16lf19196.inc
// Register: LATH
#define LATH LATH
LATH                                     equ 0C91h
// bitfield definitions
LATH_LATH0_POSN                          equ 0000h
LATH_LATH0_POSITION                      equ 0000h
LATH_LATH0_SIZE                          equ 0001h
LATH_LATH0_LENGTH                        equ 0001h
LATH_LATH0_MASK                          equ 0001h
LATH_LATH1_POSN                          equ 0001h
LATH_LATH1_POSITION                      equ 0001h
LATH_LATH1_SIZE                          equ 0001h
LATH_LATH1_LENGTH                        equ 0001h
LATH_LATH1_MASK                          equ 0002h
LATH_LATH2_POSN                          equ 0002h
LATH_LATH2_POSITION                      equ 0002h
LATH_LATH2_SIZE                          equ 0001h
LATH_LATH2_LENGTH                        equ 0001h
LATH_LATH2_MASK                          equ 0004h
LATH_LATH3_POSN                          equ 0003h
LATH_LATH3_POSITION                      equ 0003h
LATH_LATH3_SIZE                          equ 0001h
LATH_LATH3_LENGTH                        equ 0001h
LATH_LATH3_MASK                          equ 0008h

// Register: VB0GPR
#define VB0GPR VB0GPR
VB0GPR                                   equ 0E8Ch
// bitfield definitions
VB0GPR_VB0GPR_POSN                       equ 0000h
VB0GPR_VB0GPR_POSITION                   equ 0000h
VB0GPR_VB0GPR_SIZE                       equ 0008h
VB0GPR_VB0GPR_LENGTH                     equ 0008h
VB0GPR_VB0GPR_MASK                       equ 00FFh
VB0GPR_VB0GPR0_POSN                      equ 0000h
VB0GPR_VB0GPR0_POSITION                  equ 0000h
VB0GPR_VB0GPR0_SIZE                      equ 0001h
VB0GPR_VB0GPR0_LENGTH                    equ 0001h
VB0GPR_VB0GPR0_MASK                      equ 0001h
VB0GPR_VB0GPR1_POSN                      equ 0001h
VB0GPR_VB0GPR1_POSITION                  equ 0001h
VB0GPR_VB0GPR1_SIZE                      equ 0001h
VB0GPR_VB0GPR1_LENGTH                    equ 0001h
VB0GPR_VB0GPR1_MASK                      equ 0002h
VB0GPR_VB0GPR2_POSN                      equ 0002h
VB0GPR_VB0GPR2_POSITION                  equ 0002h
VB0GPR_VB0GPR2_SIZE                      equ 0001h
VB0GPR_VB0GPR2_LENGTH                    equ 0001h
VB0GPR_VB0GPR2_MASK                      equ 0004h
VB0GPR_VB0GPR3_POSN                      equ 0003h
VB0GPR_VB0GPR3_POSITION                  equ 0003h
VB0GPR_VB0GPR3_SIZE                      equ 0001h
VB0GPR_VB0GPR3_LENGTH                    equ 0001h
VB0GPR_VB0GPR3_MASK                      equ 0008h
VB0GPR_VB0GPR4_POSN                      equ 0004h
VB0GPR_VB0GPR4_POSITION                  equ 0004h
VB0GPR_VB0GPR4_SIZE                      equ 0001h
VB0GPR_VB0GPR4_LENGTH                    equ 0001h
VB0GPR_VB0GPR4_MASK                      equ 0010h
VB0GPR_VB0GPR5_POSN                      equ 0005h
VB0GPR_VB0GPR5_POSITION                  equ 0005h
VB0GPR_VB0GPR5_SIZE                      equ 0001h
VB0GPR_VB0GPR5_LENGTH                    equ 0001h
VB0GPR_VB0GPR5_MASK                      equ 0020h
VB0GPR_VB0GPR6_POSN                      equ 0006h
VB0GPR_VB0GPR6_POSITION                  equ 0006h
VB0GPR_VB0GPR6_SIZE                      equ 0001h
VB0GPR_VB0GPR6_LENGTH                    equ 0001h
VB0GPR_VB0GPR6_MASK                      equ 0040h
VB0GPR_VB0GPR7_POSN                      equ 0007h
VB0GPR_VB0GPR7_POSITION                  equ 0007h
VB0GPR_VB0GPR7_SIZE                      equ 0001h
VB0GPR_VB0GPR7_LENGTH                    equ 0001h
VB0GPR_VB0GPR7_MASK                      equ 0080h

// Register: VB1GPR
#define VB1GPR VB1GPR
VB1GPR                                   equ 0E8Dh
// bitfield definitions
VB1GPR_VB1GPR_POSN                       equ 0000h
VB1GPR_VB1GPR_POSITION                   equ 0000h
VB1GPR_VB1GPR_SIZE                       equ 0008h
VB1GPR_VB1GPR_LENGTH                     equ 0008h
VB1GPR_VB1GPR_MASK                       equ 00FFh
VB1GPR_VB1GPR0_POSN                      equ 0000h
VB1GPR_VB1GPR0_POSITION                  equ 0000h
VB1GPR_VB1GPR0_SIZE                      equ 0001h
VB1GPR_VB1GPR0_LENGTH                    equ 0001h
VB1GPR_VB1GPR0_MASK                      equ 0001h
VB1GPR_VB1GPR1_POSN                      equ 0001h
VB1GPR_VB1GPR1_POSITION                  equ 0001h
VB1GPR_VB1GPR1_SIZE                      equ 0001h
VB1GPR_VB1GPR1_LENGTH                    equ 0001h
VB1GPR_VB1GPR1_MASK                      equ 0002h
VB1GPR_VB1GPR2_POSN                      equ 0002h
VB1GPR_VB1GPR2_POSITION                  equ 0002h
VB1GPR_VB1GPR2_SIZE                      equ 0001h
VB1GPR_VB1GPR2_LENGTH                    equ 0001h
VB1GPR_VB1GPR2_MASK                      equ 0004h
VB1GPR_VB1GPR3_POSN                      equ 0003h
VB1GPR_VB1GPR3_POSITION                  equ 0003h
VB1GPR_VB1GPR3_SIZE                      equ 0001h
VB1GPR_VB1GPR3_LENGTH                    equ 0001h
VB1GPR_VB1GPR3_MASK                      equ 0008h
VB1GPR_VB1GPR4_POSN                      equ 0004h
VB1GPR_VB1GPR4_POSITION                  equ 0004h
VB1GPR_VB1GPR4_SIZE                      equ 0001h
VB1GPR_VB1GPR4_LENGTH                    equ 0001h
VB1GPR_VB1GPR4_MASK                      equ 0010h
VB1GPR_VB1GPR5_POSN                      equ 0005h
VB1GPR_VB1GPR5_POSITION                  equ 0005h
VB1GPR_VB1GPR5_SIZE                      equ 0001h
VB1GPR_VB1GPR5_LENGTH                    equ 0001h
VB1GPR_VB1GPR5_MASK                      equ 0020h
VB1GPR_VB1GPR6_POSN                      equ 0006h
VB1GPR_VB1GPR6_POSITION                  equ 0006h
VB1GPR_VB1GPR6_SIZE                      equ 0001h
VB1GPR_VB1GPR6_LENGTH                    equ 0001h
VB1GPR_VB1GPR6_MASK                      equ 0040h
VB1GPR_VB1GPR7_POSN                      equ 0007h
VB1GPR_VB1GPR7_POSITION                  equ 0007h
VB1GPR_VB1GPR7_SIZE                      equ 0001h
VB1GPR_VB1GPR7_LENGTH                    equ 0001h
VB1GPR_VB1GPR7_MASK                      equ 0080h

// Register: VB2GPR
#define VB2GPR VB2GPR
VB2GPR                                   equ 0E8Eh
// bitfield definitions
VB2GPR_VB2GPR_POSN                       equ 0000h
VB2GPR_VB2GPR_POSITION                   equ 0000h
VB2GPR_VB2GPR_SIZE                       equ 0008h
VB2GPR_VB2GPR_LENGTH                     equ 0008h
VB2GPR_VB2GPR_MASK                       equ 00FFh
VB2GPR_VB2GPR0_POSN                      equ 0000h
VB2GPR_VB2GPR0_POSITION                  equ 0000h
VB2GPR_VB2GPR0_SIZE                      equ 0001h
VB2GPR_VB2GPR0_LENGTH                    equ 0001h
VB2GPR_VB2GPR0_MASK                      equ 0001h
VB2GPR_VB2GPR1_POSN                      equ 0001h
VB2GPR_VB2GPR1_POSITION                  equ 0001h
VB2GPR_VB2GPR1_SIZE                      equ 0001h
VB2GPR_VB2GPR1_LENGTH                    equ 0001h
VB2GPR_VB2GPR1_MASK                      equ 0002h
VB2GPR_VB2GPR2_POSN                      equ 0002h
VB2GPR_VB2GPR2_POSITION                  equ 0002h
VB2GPR_VB2GPR2_SIZE                      equ 0001h
VB2GPR_VB2GPR2_LENGTH                    equ 0001h
VB2GPR_VB2GPR2_MASK                      equ 0004h
VB2GPR_VB2GPR3_POSN                      equ 0003h
VB2GPR_VB2GPR3_POSITION                  equ 0003h
VB2GPR_VB2GPR3_SIZE                      equ 0001h
VB2GPR_VB2GPR3_LENGTH                    equ 0001h
VB2GPR_VB2GPR3_MASK                      equ 0008h
VB2GPR_VB2GPR4_POSN                      equ 0004h
VB2GPR_VB2GPR4_POSITION                  equ 0004h
VB2GPR_VB2GPR4_SIZE                      equ 0001h
VB2GPR_VB2GPR4_LENGTH                    equ 0001h
VB2GPR_VB2GPR4_MASK                      equ 0010h
VB2GPR_VB2GPR5_POSN                      equ 0005h
VB2GPR_VB2GPR5_POSITION                  equ 0005h
VB2GPR_VB2GPR5_SIZE                      equ 0001h
VB2GPR_VB2GPR5_LENGTH                    equ 0001h
VB2GPR_VB2GPR5_MASK                      equ 0020h
VB2GPR_VB2GPR6_POSN                      equ 0006h
VB2GPR_VB2GPR6_POSITION                  equ 0006h
VB2GPR_VB2GPR6_SIZE                      equ 0001h
VB2GPR_VB2GPR6_LENGTH                    equ 0001h
VB2GPR_VB2GPR6_MASK                      equ 0040h
VB2GPR_VB2GPR7_POSN                      equ 0007h
VB2GPR_VB2GPR7_POSITION                  equ 0007h
VB2GPR_VB2GPR7_SIZE                      equ 0001h
VB2GPR_VB2GPR7_LENGTH                    equ 0001h
VB2GPR_VB2GPR7_MASK                      equ 0080h

// Register: VB3GPR
#define VB3GPR VB3GPR
VB3GPR                                   equ 0E8Fh
// bitfield definitions
VB3GPR_VB3GPR_POSN                       equ 0000h
VB3GPR_VB3GPR_POSITION                   equ 0000h
VB3GPR_VB3GPR_SIZE                       equ 0008h
VB3GPR_VB3GPR_LENGTH                     equ 0008h
VB3GPR_VB3GPR_MASK                       equ 00FFh
VB3GPR_VB3GPR0_POSN                      equ 0000h
VB3GPR_VB3GPR0_POSITION                  equ 0000h
VB3GPR_VB3GPR0_SIZE                      equ 0001h
VB3GPR_VB3GPR0_LENGTH                    equ 0001h
VB3GPR_VB3GPR0_MASK                      equ 0001h
VB3GPR_VB3GPR1_POSN                      equ 0001h
VB3GPR_VB3GPR1_POSITION                  equ 0001h
VB3GPR_VB3GPR1_SIZE                      equ 0001h
VB3GPR_VB3GPR1_LENGTH                    equ 0001h
VB3GPR_VB3GPR1_MASK                      equ 0002h
VB3GPR_VB3GPR2_POSN                      equ 0002h
VB3GPR_VB3GPR2_POSITION                  equ 0002h
VB3GPR_VB3GPR2_SIZE                      equ 0001h
VB3GPR_VB3GPR2_LENGTH                    equ 0001h
VB3GPR_VB3GPR2_MASK                      equ 0004h
VB3GPR_VB3GPR3_POSN                      equ 0003h
VB3GPR_VB3GPR3_POSITION                  equ 0003h
VB3GPR_VB3GPR3_SIZE                      equ 0001h
VB3GPR_VB3GPR3_LENGTH                    equ 0001h
VB3GPR_VB3GPR3_MASK                      equ 0008h
VB3GPR_VB3GPR4_POSN                      equ 0004h
VB3GPR_VB3GPR4_POSITION                  equ 0004h
VB3GPR_VB3GPR4_SIZE                      equ 0001h
VB3GPR_VB3GPR4_LENGTH                    equ 0001h
VB3GPR_VB3GPR4_MASK                      equ 0010h
VB3GPR_VB3GPR5_POSN                      equ 0005h
VB3GPR_VB3GPR5_POSITION                  equ 0005h
VB3GPR_VB3GPR5_SIZE                      equ 0001h
VB3GPR_VB3GPR5_LENGTH                    equ 0001h
VB3GPR_VB3GPR5_MASK                      equ 0020h
VB3GPR_VB3GPR6_POSN                      equ 0006h
VB3GPR_VB3GPR6_POSITION                  equ 0006h
VB3GPR_VB3GPR6_SIZE                      equ 0001h
VB3GPR_VB3GPR6_LENGTH                    equ 0001h
VB3GPR_VB3GPR6_MASK                      equ 0040h
VB3GPR_VB3GPR7_POSN                      equ 0007h
VB3GPR_VB3GPR7_POSITION                  equ 0007h
VB3GPR_VB3GPR7_SIZE                      equ 0001h
VB3GPR_VB3GPR7_LENGTH                    equ 0001h
VB3GPR_VB3GPR7_MASK                      equ 0080h

