GopalSaraf/Practicals/PSDL/include/proc/pic16lf19196.inc
// Register: IOCGN
#define IOCGN IOCGN
IOCGN                                    equ 01E61h
// bitfield definitions
IOCGN_IOCGN5_POSN                        equ 0005h
IOCGN_IOCGN5_POSITION                    equ 0005h
IOCGN_IOCGN5_SIZE                        equ 0001h
IOCGN_IOCGN5_LENGTH                      equ 0001h
IOCGN_IOCGN5_MASK                        equ 0020h

// Register: IOCGF
#define IOCGF IOCGF
IOCGF                                    equ 01E62h
// bitfield definitions
IOCGF_IOCGF5_POSN                        equ 0005h
IOCGF_IOCGF5_POSITION                    equ 0005h
IOCGF_IOCGF5_SIZE                        equ 0001h
IOCGF_IOCGF5_LENGTH                      equ 0001h
IOCGF_IOCGF5_MASK                        equ 0020h

// Register: ANSELH
#define ANSELH ANSELH
ANSELH                                   equ 01E66h
// bitfield definitions
ANSELH_ANSELH0_POSN                      equ 0000h
ANSELH_ANSELH0_POSITION                  equ 0000h
ANSELH_ANSELH0_SIZE                      equ 0001h
ANSELH_ANSELH0_LENGTH                    equ 0001h
ANSELH_ANSELH0_MASK                      equ 0001h
ANSELH_ANSELH1_POSN                      equ 0001h
ANSELH_ANSELH1_POSITION                  equ 0001h
ANSELH_ANSELH1_SIZE                      equ 0001h
ANSELH_ANSELH1_LENGTH                    equ 0001h
ANSELH_ANSELH1_MASK                      equ 0002h
ANSELH_ANSELH2_POSN                      equ 0002h
ANSELH_ANSELH2_POSITION                  equ 0002h
ANSELH_ANSELH2_SIZE                      equ 0001h
ANSELH_ANSELH2_LENGTH                    equ 0001h
ANSELH_ANSELH2_MASK                      equ 0004h
ANSELH_ANSELH3_POSN                      equ 0003h
ANSELH_ANSELH3_POSITION                  equ 0003h
ANSELH_ANSELH3_SIZE                      equ 0001h
ANSELH_ANSELH3_LENGTH                    equ 0001h
ANSELH_ANSELH3_MASK                      equ 0008h

// Register: WPUH
#define WPUH WPUH
WPUH                                     equ 01E67h
// bitfield definitions
WPUH_WPUH0_POSN                          equ 0000h
WPUH_WPUH0_POSITION                      equ 0000h
WPUH_WPUH0_SIZE                          equ 0001h
WPUH_WPUH0_LENGTH                        equ 0001h
WPUH_WPUH0_MASK                          equ 0001h
WPUH_WPUH1_POSN                          equ 0001h
WPUH_WPUH1_POSITION                      equ 0001h
WPUH_WPUH1_SIZE                          equ 0001h
WPUH_WPUH1_LENGTH                        equ 0001h
WPUH_WPUH1_MASK                          equ 0002h
WPUH_WPUH2_POSN                          equ 0002h
WPUH_WPUH2_POSITION                      equ 0002h
WPUH_WPUH2_SIZE                          equ 0001h
WPUH_WPUH2_LENGTH                        equ 0001h
WPUH_WPUH2_MASK                          equ 0004h
WPUH_WPUH3_POSN                          equ 0003h
WPUH_WPUH3_POSITION                      equ 0003h
WPUH_WPUH3_SIZE                          equ 0001h
WPUH_WPUH3_LENGTH                        equ 0001h
WPUH_WPUH3_MASK                          equ 0008h

// Register: ODCONH
#define ODCONH ODCONH
ODCONH                                   equ 01E68h
// bitfield definitions
ODCONH_ODCH0_POSN                        equ 0000h
ODCONH_ODCH0_POSITION                    equ 0000h
ODCONH_ODCH0_SIZE                        equ 0001h
ODCONH_ODCH0_LENGTH                      equ 0001h
ODCONH_ODCH0_MASK                        equ 0001h
ODCONH_ODCH1_POSN                        equ 0001h
ODCONH_ODCH1_POSITION                    equ 0001h
ODCONH_ODCH1_SIZE                        equ 0001h
ODCONH_ODCH1_LENGTH                      equ 0001h
ODCONH_ODCH1_MASK                        equ 0002h
ODCONH_ODCH2_POSN                        equ 0002h
ODCONH_ODCH2_POSITION                    equ 0002h
ODCONH_ODCH2_SIZE                        equ 0001h
ODCONH_ODCH2_LENGTH                      equ 0001h
ODCONH_ODCH2_MASK                        equ 0004h
ODCONH_ODCH3_POSN                        equ 0003h
ODCONH_ODCH3_POSITION                    equ 0003h
ODCONH_ODCH3_SIZE                        equ 0001h
ODCONH_ODCH3_LENGTH                      equ 0001h
ODCONH_ODCH3_MASK                        equ 0008h

// Register: SLRCONH
#define SLRCONH SLRCONH
SLRCONH                                  equ 01E69h
// bitfield definitions
SLRCONH_SLRH0_POSN                       equ 0000h
SLRCONH_SLRH0_POSITION                   equ 0000h
SLRCONH_SLRH0_SIZE                       equ 0001h
SLRCONH_SLRH0_LENGTH                     equ 0001h
SLRCONH_SLRH0_MASK                       equ 0001h
SLRCONH_SLRH1_POSN                       equ 0001h
SLRCONH_SLRH1_POSITION                   equ 0001h
SLRCONH_SLRH1_SIZE                       equ 0001h
SLRCONH_SLRH1_LENGTH                     equ 0001h
SLRCONH_SLRH1_MASK                       equ 0002h
SLRCONH_SLRH2_POSN                       equ 0002h
SLRCONH_SLRH2_POSITION                   equ 0002h
SLRCONH_SLRH2_SIZE                       equ 0001h
SLRCONH_SLRH2_LENGTH                     equ 0001h
SLRCONH_SLRH2_MASK                       equ 0004h
SLRCONH_SLRH3_POSN                       equ 0003h
SLRCONH_SLRH3_POSITION                   equ 0003h
SLRCONH_SLRH3_SIZE                       equ 0001h
SLRCONH_SLRH3_LENGTH                     equ 0001h
SLRCONH_SLRH3_MASK                       equ 0008h

// Register: INLVLH
#define INLVLH INLVLH
INLVLH                                   equ 01E6Ah
// bitfield definitions
INLVLH_INLVLH0_POSN                      equ 0000h
INLVLH_INLVLH0_POSITION                  equ 0000h
INLVLH_INLVLH0_SIZE                      equ 0001h
INLVLH_INLVLH0_LENGTH                    equ 0001h
INLVLH_INLVLH0_MASK                      equ 0001h
INLVLH_INLVLH1_POSN                      equ 0001h
INLVLH_INLVLH1_POSITION                  equ 0001h
INLVLH_INLVLH1_SIZE                      equ 0001h
INLVLH_INLVLH1_LENGTH                    equ 0001h
INLVLH_INLVLH1_MASK                      equ 0002h
INLVLH_INLVLH2_POSN                      equ 0002h
INLVLH_INLVLH2_POSITION                  equ 0002h
INLVLH_INLVLH2_SIZE                      equ 0001h
INLVLH_INLVLH2_LENGTH                    equ 0001h
INLVLH_INLVLH2_MASK                      equ 0004h
INLVLH_INLVLH3_POSN                      equ 0003h
INLVLH_INLVLH3_POSITION                  equ 0003h
INLVLH_INLVLH3_SIZE                      equ 0001h
INLVLH_INLVLH3_LENGTH                    equ 0001h
INLVLH_INLVLH3_MASK                      equ 0008h

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
PPSLOCK                                  equ 01E8Fh
// bitfield definitions
PPSLOCK_PPSLOCKED_POSN                   equ 0000h
PPSLOCK_PPSLOCKED_POSITION               equ 0000h
PPSLOCK_PPSLOCKED_SIZE                   equ 0001h
PPSLOCK_PPSLOCKED_LENGTH                 equ 0001h
PPSLOCK_PPSLOCKED_MASK                   equ 0001h

// Register: INTPPS
#define INTPPS INTPPS
INTPPS                                   equ 01E90h
// bitfield definitions
INTPPS_INTPPS_POSN                       equ 0000h
INTPPS_INTPPS_POSITION                   equ 0000h
INTPPS_INTPPS_SIZE                       equ 0006h
INTPPS_INTPPS_LENGTH                     equ 0006h
INTPPS_INTPPS_MASK                       equ 003Fh
INTPPS_INTPPS0_POSN                      equ 0000h
INTPPS_INTPPS0_POSITION                  equ 0000h
INTPPS_INTPPS0_SIZE                      equ 0001h
INTPPS_INTPPS0_LENGTH                    equ 0001h
INTPPS_INTPPS0_MASK                      equ 0001h
INTPPS_INTPPS1_POSN                      equ 0001h
INTPPS_INTPPS1_POSITION                  equ 0001h
INTPPS_INTPPS1_SIZE                      equ 0001h
INTPPS_INTPPS1_LENGTH                    equ 0001h
INTPPS_INTPPS1_MASK                      equ 0002h
INTPPS_INTPPS2_POSN                      equ 0002h
INTPPS_INTPPS2_POSITION                  equ 0002h
INTPPS_INTPPS2_SIZE                      equ 0001h
INTPPS_INTPPS2_LENGTH                    equ 0001h
INTPPS_INTPPS2_MASK                      equ 0004h
INTPPS_INTPPS3_POSN                      equ 0003h
INTPPS_INTPPS3_POSITION                  equ 0003h
INTPPS_INTPPS3_SIZE                      equ 0001h
INTPPS_INTPPS3_LENGTH                    equ 0001h
INTPPS_INTPPS3_MASK                      equ 0008h
INTPPS_INTPPS4_POSN                      equ 0004h
INTPPS_INTPPS4_POSITION                  equ 0004h
INTPPS_INTPPS4_SIZE                      equ 0001h
INTPPS_INTPPS4_LENGTH                    equ 0001h
INTPPS_INTPPS4_MASK                      equ 0010h

// Register: T0CKIPPS
#define T0CKIPPS T0CKIPPS
T0CKIPPS                                 equ 01E91h
// bitfield definitions
T0CKIPPS_T0CKIPPS_POSN                   equ 0000h
T0CKIPPS_T0CKIPPS_POSITION               equ 0000h
T0CKIPPS_T0CKIPPS_SIZE                   equ 0006h
T0CKIPPS_T0CKIPPS_LENGTH                 equ 0006h
T0CKIPPS_T0CKIPPS_MASK                   equ 003Fh
T0CKIPPS_T0CKIPPS0_POSN                  equ 0000h
T0CKIPPS_T0CKIPPS0_POSITION              equ 0000h
T0CKIPPS_T0CKIPPS0_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS0_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS0_MASK                  equ 0001h
T0CKIPPS_T0CKIPPS1_POSN                  equ 0001h
T0CKIPPS_T0CKIPPS1_POSITION              equ 0001h
T0CKIPPS_T0CKIPPS1_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS1_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS1_MASK                  equ 0002h
T0CKIPPS_T0CKIPPS2_POSN                  equ 0002h
T0CKIPPS_T0CKIPPS2_POSITION              equ 0002h
T0CKIPPS_T0CKIPPS2_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS2_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS2_MASK                  equ 0004h
T0CKIPPS_T0CKIPPS3_POSN                  equ 0003h
T0CKIPPS_T0CKIPPS3_POSITION              equ 0003h
T0CKIPPS_T0CKIPPS3_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS3_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS3_MASK                  equ 0008h
T0CKIPPS_T0CKIPPS4_POSN                  equ 0004h
T0CKIPPS_T0CKIPPS4_POSITION              equ 0004h
T0CKIPPS_T0CKIPPS4_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS4_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS4_MASK                  equ 0010h

// Register: T1CKIPPS
#define T1CKIPPS T1CKIPPS
T1CKIPPS                                 equ 01E92h
// bitfield definitions
T1CKIPPS_T1CKIPPS_POSN                   equ 0000h
T1CKIPPS_T1CKIPPS_POSITION               equ 0000h
T1CKIPPS_T1CKIPPS_SIZE                   equ 0006h
T1CKIPPS_T1CKIPPS_LENGTH                 equ 0006h
T1CKIPPS_T1CKIPPS_MASK                   equ 003Fh
T1CKIPPS_T1CKIPPS0_POSN                  equ 0000h
T1CKIPPS_T1CKIPPS0_POSITION              equ 0000h
T1CKIPPS_T1CKIPPS0_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS0_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS0_MASK                  equ 0001h
T1CKIPPS_T1CKIPPS1_POSN                  equ 0001h
T1CKIPPS_T1CKIPPS1_POSITION              equ 0001h
T1CKIPPS_T1CKIPPS1_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS1_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS1_MASK                  equ 0002h
T1CKIPPS_T1CKIPPS2_POSN                  equ 0002h
T1CKIPPS_T1CKIPPS2_POSITION              equ 0002h
T1CKIPPS_T1CKIPPS2_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS2_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS2_MASK                  equ 0004h
T1CKIPPS_T1CKIPPS3_POSN                  equ 0003h
T1CKIPPS_T1CKIPPS3_POSITION              equ 0003h
T1CKIPPS_T1CKIPPS3_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS3_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS3_MASK                  equ 0008h
T1CKIPPS_T1CKIPPS4_POSN                  equ 0004h
T1CKIPPS_T1CKIPPS4_POSITION              equ 0004h
T1CKIPPS_T1CKIPPS4_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS4_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS4_MASK                  equ 0010h

// Register: T1GPPS
#define T1GPPS T1GPPS
T1GPPS                                   equ 01E93h
// bitfield definitions
T1GPPS_T1GPPS_POSN                       equ 0000h
T1GPPS_T1GPPS_POSITION                   equ 0000h
T1GPPS_T1GPPS_SIZE                       equ 0006h
T1GPPS_T1GPPS_LENGTH                     equ 0006h
T1GPPS_T1GPPS_MASK                       equ 003Fh
T1GPPS_T1GPPS0_POSN                      equ 0000h
T1GPPS_T1GPPS0_POSITION                  equ 0000h
T1GPPS_T1GPPS0_SIZE                      equ 0001h
T1GPPS_T1GPPS0_LENGTH                    equ 0001h
T1GPPS_T1GPPS0_MASK                      equ 0001h
T1GPPS_T1GPPS1_POSN                      equ 0001h
T1GPPS_T1GPPS1_POSITION                  equ 0001h
T1GPPS_T1GPPS1_SIZE                      equ 0001h
T1GPPS_T1GPPS1_LENGTH                    equ 0001h
T1GPPS_T1GPPS1_MASK                      equ 0002h
T1GPPS_T1GPPS2_POSN                      equ 0002h
T1GPPS_T1GPPS2_POSITION                  equ 0002h
T1GPPS_T1GPPS2_SIZE                      equ 0001h
T1GPPS_T1GPPS2_LENGTH                    equ 0001h
T1GPPS_T1GPPS2_MASK                      equ 0004h
T1GPPS_T1GPPS3_POSN                      equ 0003h
T1GPPS_T1GPPS3_POSITION                  equ 0003h
T1GPPS_T1GPPS3_SIZE                      equ 0001h
T1GPPS_T1GPPS3_LENGTH                    equ 0001h
T1GPPS_T1GPPS3_MASK                      equ 0008h
T1GPPS_T1GPPS4_POSN                      equ 0004h
T1GPPS_T1GPPS4_POSITION                  equ 0004h
T1GPPS_T1GPPS4_SIZE                      equ 0001h
T1GPPS_T1GPPS4_LENGTH                    equ 0001h
T1GPPS_T1GPPS4_MASK                      equ 0010h

