GopalSaraf/Practicals/PSDL/include/proc/pic16lf19196.inc
#define PSCNT2                           BANKMASK(WDTPSL), 2
#define PSCNT3                           BANKMASK(WDTPSL), 3
#define PSCNT4                           BANKMASK(WDTPSL), 4
#define PSCNT5                           BANKMASK(WDTPSL), 5
#define PSCNT6                           BANKMASK(WDTPSL), 6
#define PSCNT7                           BANKMASK(WDTPSL), 7
#define PSCNT8                           BANKMASK(WDTPSH), 0
#define PSCNT9                           BANKMASK(WDTPSH), 1
#define PSIS                             BANKMASK(ADCON2), 7
#define PSS0                             BANKMASK(DAC1CON0), 2
#define PSS1                             BANKMASK(DAC1CON0), 3
#define PWM3DC0                          BANKMASK(PWM3DCL), 6
#define PWM3DC1                          BANKMASK(PWM3DCL), 7
#define PWM3DC2                          BANKMASK(PWM3DCH), 0
#define PWM3DC3                          BANKMASK(PWM3DCH), 1
#define PWM3DC4                          BANKMASK(PWM3DCH), 2
#define PWM3DC5                          BANKMASK(PWM3DCH), 3
#define PWM3DC6                          BANKMASK(PWM3DCH), 4
#define PWM3DC7                          BANKMASK(PWM3DCH), 5
#define PWM3DC8                          BANKMASK(PWM3DCH), 6
#define PWM3DC9                          BANKMASK(PWM3DCH), 7
#define PWM3EN                           BANKMASK(PWM3CON), 7
#define PWM3OUT                          BANKMASK(PWM3CON), 5
#define PWM3POL                          BANKMASK(PWM3CON), 4
#define PWM4DC0                          BANKMASK(PWM4DCL), 6
#define PWM4DC1                          BANKMASK(PWM4DCL), 7
#define PWM4DC2                          BANKMASK(PWM4DCH), 0
#define PWM4DC3                          BANKMASK(PWM4DCH), 1
#define PWM4DC4                          BANKMASK(PWM4DCH), 2
#define PWM4DC5                          BANKMASK(PWM4DCH), 3
#define PWM4DC6                          BANKMASK(PWM4DCH), 4
#define PWM4DC7                          BANKMASK(PWM4DCH), 5
#define PWM4DC8                          BANKMASK(PWM4DCH), 6
#define PWM4DC9                          BANKMASK(PWM4DCH), 7
#define PWM4EN                           BANKMASK(PWM4CON), 7
#define PWM4OUT                          BANKMASK(PWM4CON), 5
#define PWM4POL                          BANKMASK(PWM4CON), 4
#define RA0                              BANKMASK(PORTA), 0
#define RA0PPS0                          BANKMASK(RA0PPS), 0
#define RA0PPS1                          BANKMASK(RA0PPS), 1
#define RA0PPS2                          BANKMASK(RA0PPS), 2
#define RA0PPS3                          BANKMASK(RA0PPS), 3
#define RA0PPS4                          BANKMASK(RA0PPS), 4
#define RA0PPS5                          BANKMASK(RA0PPS), 5
#define RA1                              BANKMASK(PORTA), 1
#define RA1PPS0                          BANKMASK(RA1PPS), 0
#define RA1PPS1                          BANKMASK(RA1PPS), 1
#define RA1PPS2                          BANKMASK(RA1PPS), 2
#define RA1PPS3                          BANKMASK(RA1PPS), 3
#define RA1PPS4                          BANKMASK(RA1PPS), 4
#define RA1PPS5                          BANKMASK(RA1PPS), 5
#define RA2                              BANKMASK(PORTA), 2
#define RA2PPS0                          BANKMASK(RA2PPS), 0
#define RA2PPS1                          BANKMASK(RA2PPS), 1
#define RA2PPS2                          BANKMASK(RA2PPS), 2
#define RA2PPS3                          BANKMASK(RA2PPS), 3
#define RA2PPS4                          BANKMASK(RA2PPS), 4
#define RA2PPS5                          BANKMASK(RA2PPS), 5
#define RA3                              BANKMASK(PORTA), 3
#define RA3PPS0                          BANKMASK(RA3PPS), 0
#define RA3PPS1                          BANKMASK(RA3PPS), 1
#define RA3PPS2                          BANKMASK(RA3PPS), 2
#define RA3PPS3                          BANKMASK(RA3PPS), 3
#define RA3PPS4                          BANKMASK(RA3PPS), 4
#define RA3PPS5                          BANKMASK(RA3PPS), 5
#define RA4                              BANKMASK(PORTA), 4
#define RA4PPS0                          BANKMASK(RA4PPS), 0
#define RA4PPS1                          BANKMASK(RA4PPS), 1
#define RA4PPS2                          BANKMASK(RA4PPS), 2
#define RA4PPS3                          BANKMASK(RA4PPS), 3
#define RA4PPS4                          BANKMASK(RA4PPS), 4
#define RA4PPS5                          BANKMASK(RA4PPS), 5
#define RA5                              BANKMASK(PORTA), 5
#define RA5PPS0                          BANKMASK(RA5PPS), 0
#define RA5PPS1                          BANKMASK(RA5PPS), 1
#define RA5PPS2                          BANKMASK(RA5PPS), 2
#define RA5PPS3                          BANKMASK(RA5PPS), 3
#define RA5PPS4                          BANKMASK(RA5PPS), 4
#define RA5PPS5                          BANKMASK(RA5PPS), 5
#define RA6                              BANKMASK(PORTA), 6
#define RA6PPS0                          BANKMASK(RA6PPS), 0
#define RA6PPS1                          BANKMASK(RA6PPS), 1
#define RA6PPS2                          BANKMASK(RA6PPS), 2
#define RA6PPS3                          BANKMASK(RA6PPS), 3
#define RA6PPS4                          BANKMASK(RA6PPS), 4
#define RA6PPS5                          BANKMASK(RA6PPS), 5
#define RA7                              BANKMASK(PORTA), 7
#define RA7PPS0                          BANKMASK(RA7PPS), 0
#define RA7PPS1                          BANKMASK(RA7PPS), 1
#define RA7PPS2                          BANKMASK(RA7PPS), 2
#define RA7PPS3                          BANKMASK(RA7PPS), 3
#define RA7PPS4                          BANKMASK(RA7PPS), 4
#define RA7PPS5                          BANKMASK(RA7PPS), 5
#define RB0                              BANKMASK(PORTB), 0
#define RB0PPS0                          BANKMASK(RB0PPS), 0
#define RB0PPS1                          BANKMASK(RB0PPS), 1
#define RB0PPS2                          BANKMASK(RB0PPS), 2
#define RB0PPS3                          BANKMASK(RB0PPS), 3
#define RB0PPS4                          BANKMASK(RB0PPS), 4
#define RB0PPS5                          BANKMASK(RB0PPS), 5
#define RB1                              BANKMASK(PORTB), 1
#define RB1PPS0                          BANKMASK(RB1PPS), 0
#define RB1PPS1                          BANKMASK(RB1PPS), 1
#define RB1PPS2                          BANKMASK(RB1PPS), 2
#define RB1PPS3                          BANKMASK(RB1PPS), 3
#define RB1PPS4                          BANKMASK(RB1PPS), 4
#define RB1PPS5                          BANKMASK(RB1PPS), 5
#define RB2                              BANKMASK(PORTB), 2
#define RB2PPS0                          BANKMASK(RB2PPS), 0
#define RB2PPS1                          BANKMASK(RB2PPS), 1
#define RB2PPS2                          BANKMASK(RB2PPS), 2
#define RB2PPS3                          BANKMASK(RB2PPS), 3
#define RB2PPS4                          BANKMASK(RB2PPS), 4
#define RB2PPS5                          BANKMASK(RB2PPS), 5
#define RB3                              BANKMASK(PORTB), 3
#define RB3PPS0                          BANKMASK(RB3PPS), 0
#define RB3PPS1                          BANKMASK(RB3PPS), 1
#define RB3PPS2                          BANKMASK(RB3PPS), 2
#define RB3PPS3                          BANKMASK(RB3PPS), 3
#define RB3PPS4                          BANKMASK(RB3PPS), 4
#define RB3PPS5                          BANKMASK(RB3PPS), 5
#define RB4                              BANKMASK(PORTB), 4
#define RB4PPS0                          BANKMASK(RB4PPS), 0
#define RB4PPS1                          BANKMASK(RB4PPS), 1
#define RB4PPS2                          BANKMASK(RB4PPS), 2
#define RB4PPS3                          BANKMASK(RB4PPS), 3
#define RB4PPS4                          BANKMASK(RB4PPS), 4
#define RB4PPS5                          BANKMASK(RB4PPS), 5
#define RB5                              BANKMASK(PORTB), 5
#define RB5PPS0                          BANKMASK(RB5PPS), 0
#define RB5PPS1                          BANKMASK(RB5PPS), 1
#define RB5PPS2                          BANKMASK(RB5PPS), 2
#define RB5PPS3                          BANKMASK(RB5PPS), 3
#define RB5PPS4                          BANKMASK(RB5PPS), 4
#define RB5PPS5                          BANKMASK(RB5PPS), 5
#define RB6                              BANKMASK(PORTB), 6
#define RB6PPS0                          BANKMASK(RB6PPS), 0
#define RB6PPS1                          BANKMASK(RB6PPS), 1
#define RB6PPS2                          BANKMASK(RB6PPS), 2
#define RB6PPS3                          BANKMASK(RB6PPS), 3
#define RB6PPS4                          BANKMASK(RB6PPS), 4
#define RB6PPS5                          BANKMASK(RB6PPS), 5
#define RB7                              BANKMASK(PORTB), 7
#define RB7PPS0                          BANKMASK(RB7PPS), 0
#define RB7PPS1                          BANKMASK(RB7PPS), 1
#define RB7PPS2                          BANKMASK(RB7PPS), 2
#define RB7PPS3                          BANKMASK(RB7PPS), 3
#define RB7PPS4                          BANKMASK(RB7PPS), 4
#define RB7PPS5                          BANKMASK(RB7PPS), 5
#define RC0                              BANKMASK(PORTC), 0
#define RC0PPS0                          BANKMASK(RC0PPS), 0
#define RC0PPS1                          BANKMASK(RC0PPS), 1
#define RC0PPS2                          BANKMASK(RC0PPS), 2
#define RC0PPS3                          BANKMASK(RC0PPS), 3
#define RC0PPS4                          BANKMASK(RC0PPS), 4
#define RC0PPS5                          BANKMASK(RC0PPS), 5
#define RC1                              BANKMASK(PORTC), 1
#define RC1IE                            BANKMASK(PIE3), 5
#define RC1IF                            BANKMASK(PIR3), 5
#define RC1PPS0                          BANKMASK(RC1PPS), 0
#define RC1PPS1                          BANKMASK(RC1PPS), 1
#define RC1PPS2                          BANKMASK(RC1PPS), 2
#define RC1PPS3                          BANKMASK(RC1PPS), 3
#define RC1PPS4                          BANKMASK(RC1PPS), 4
#define RC1PPS5                          BANKMASK(RC1PPS), 5
#define RC2                              BANKMASK(PORTC), 2
#define RC2IE                            BANKMASK(PIE3), 7
#define RC2IF                            BANKMASK(PIR3), 7
#define RC2PPS0                          BANKMASK(RC2PPS), 0
#define RC2PPS1                          BANKMASK(RC2PPS), 1
#define RC2PPS2                          BANKMASK(RC2PPS), 2
#define RC2PPS3                          BANKMASK(RC2PPS), 3
#define RC2PPS4                          BANKMASK(RC2PPS), 4
#define RC2PPS5                          BANKMASK(RC2PPS), 5
#define RC3                              BANKMASK(PORTC), 3
#define RC3PPS0                          BANKMASK(RC3PPS), 0
#define RC3PPS1                          BANKMASK(RC3PPS), 1
#define RC3PPS2                          BANKMASK(RC3PPS), 2
#define RC3PPS3                          BANKMASK(RC3PPS), 3
#define RC3PPS4                          BANKMASK(RC3PPS), 4
#define RC3PPS5                          BANKMASK(RC3PPS), 5
#define RC4                              BANKMASK(PORTC), 4
#define RC4PPS0                          BANKMASK(RC4PPS), 0
#define RC4PPS1                          BANKMASK(RC4PPS), 1
#define RC4PPS2                          BANKMASK(RC4PPS), 2
#define RC4PPS3                          BANKMASK(RC4PPS), 3
#define RC4PPS4                          BANKMASK(RC4PPS), 4
#define RC4PPS5                          BANKMASK(RC4PPS), 5
#define RC5                              BANKMASK(PORTC), 5
#define RC5PPS0                          BANKMASK(RC5PPS), 0
#define RC5PPS1                          BANKMASK(RC5PPS), 1
#define RC5PPS2                          BANKMASK(RC5PPS), 2
#define RC5PPS3                          BANKMASK(RC5PPS), 3
#define RC5PPS4                          BANKMASK(RC5PPS), 4
#define RC5PPS5                          BANKMASK(RC5PPS), 5
#define RC6                              BANKMASK(PORTC), 6
#define RC6PPS0                          BANKMASK(RC6PPS), 0
#define RC6PPS1                          BANKMASK(RC6PPS), 1
#define RC6PPS2                          BANKMASK(RC6PPS), 2
#define RC6PPS3                          BANKMASK(RC6PPS), 3
#define RC6PPS4                          BANKMASK(RC6PPS), 4
#define RC6PPS5                          BANKMASK(RC6PPS), 5
#define RC7                              BANKMASK(PORTC), 7
#define RC7PPS0                          BANKMASK(RC7PPS), 0
#define RC7PPS1                          BANKMASK(RC7PPS), 1
#define RC7PPS2                          BANKMASK(RC7PPS), 2
#define RC7PPS3                          BANKMASK(RC7PPS), 3
#define RC7PPS4                          BANKMASK(RC7PPS), 4
#define RC7PPS5                          BANKMASK(RC7PPS), 5
#define RCEN                             BANKMASK(SSP1CON2), 3
#define RCEN1                            BANKMASK(SSP1CON2), 3
#define RD                               BANKMASK(NVMCON1), 0
#define RD0                              BANKMASK(PORTD), 0
#define RD0PPS0                          BANKMASK(RD0PPS), 0
#define RD0PPS1                          BANKMASK(RD0PPS), 1
#define RD0PPS2                          BANKMASK(RD0PPS), 2
#define RD0PPS3                          BANKMASK(RD0PPS), 3
#define RD0PPS4                          BANKMASK(RD0PPS), 4
#define RD0PPS5                          BANKMASK(RD0PPS), 5
#define RD1                              BANKMASK(PORTD), 1
#define RD16                             BANKMASK(T1CON), 1
#define RD161                            BANKMASK(T1CON), 1
#define RD1PPS0                          BANKMASK(RD1PPS), 0
#define RD1PPS1                          BANKMASK(RD1PPS), 1
#define RD1PPS2                          BANKMASK(RD1PPS), 2
#define RD1PPS3                          BANKMASK(RD1PPS), 3
#define RD1PPS4                          BANKMASK(RD1PPS), 4
#define RD1PPS5                          BANKMASK(RD1PPS), 5
#define RD2                              BANKMASK(PORTD), 2
#define RD2PPS0                          BANKMASK(RD2PPS), 0
#define RD2PPS1                          BANKMASK(RD2PPS), 1
#define RD2PPS2                          BANKMASK(RD2PPS), 2
#define RD2PPS3                          BANKMASK(RD2PPS), 3
#define RD2PPS4                          BANKMASK(RD2PPS), 4
#define RD2PPS5                          BANKMASK(RD2PPS), 5
#define RD3                              BANKMASK(PORTD), 3
#define RD3PPS0                          BANKMASK(RD3PPS), 0
#define RD3PPS1                          BANKMASK(RD3PPS), 1
#define RD3PPS2                          BANKMASK(RD3PPS), 2
#define RD3PPS3                          BANKMASK(RD3PPS), 3
#define RD3PPS4                          BANKMASK(RD3PPS), 4
#define RD3PPS5                          BANKMASK(RD3PPS), 5
#define RD4                              BANKMASK(PORTD), 4
#define RD4PPS0                          BANKMASK(RD4PPS), 0
#define RD4PPS1                          BANKMASK(RD4PPS), 1
#define RD4PPS2                          BANKMASK(RD4PPS), 2
#define RD4PPS3                          BANKMASK(RD4PPS), 3
#define RD4PPS4                          BANKMASK(RD4PPS), 4
#define RD4PPS5                          BANKMASK(RD4PPS), 5
#define RD5                              BANKMASK(PORTD), 5
#define RD5PPS0                          BANKMASK(RD5PPS), 0
#define RD5PPS1                          BANKMASK(RD5PPS), 1
#define RD5PPS2                          BANKMASK(RD5PPS), 2
#define RD5PPS3                          BANKMASK(RD5PPS), 3
#define RD5PPS4                          BANKMASK(RD5PPS), 4
#define RD5PPS5                          BANKMASK(RD5PPS), 5
#define RD6                              BANKMASK(PORTD), 6
#define RD6PPS0                          BANKMASK(RD6PPS), 0
#define RD6PPS1                          BANKMASK(RD6PPS), 1
#define RD6PPS2                          BANKMASK(RD6PPS), 2
#define RD6PPS3                          BANKMASK(RD6PPS), 3
#define RD6PPS4                          BANKMASK(RD6PPS), 4
#define RD6PPS5                          BANKMASK(RD6PPS), 5
#define RD7                              BANKMASK(PORTD), 7
#define RD7PPS0                          BANKMASK(RD7PPS), 0
#define RD7PPS1                          BANKMASK(RD7PPS), 1
#define RD7PPS2                          BANKMASK(RD7PPS), 2
#define RD7PPS3                          BANKMASK(RD7PPS), 3
#define RD7PPS4                          BANKMASK(RD7PPS), 4
#define RD7PPS5                          BANKMASK(RD7PPS), 5
#define RE0                              BANKMASK(PORTE), 0
#define RE0PPS0                          BANKMASK(RE0PPS), 0
#define RE0PPS1                          BANKMASK(RE0PPS), 1
#define RE0PPS2                          BANKMASK(RE0PPS), 2
#define RE0PPS3                          BANKMASK(RE0PPS), 3
#define RE0PPS4                          BANKMASK(RE0PPS), 4
#define RE0PPS5                          BANKMASK(RE0PPS), 5
#define RE1                              BANKMASK(PORTE), 1
#define RE1PPS0                          BANKMASK(RE1PPS), 0
#define RE1PPS1                          BANKMASK(RE1PPS), 1
#define RE1PPS2                          BANKMASK(RE1PPS), 2
#define RE1PPS3                          BANKMASK(RE1PPS), 3
#define RE1PPS4                          BANKMASK(RE1PPS), 4
#define RE1PPS5                          BANKMASK(RE1PPS), 5
#define RE3                              BANKMASK(PORTE), 3
#define RE3PPS0                          BANKMASK(RE3PPS), 0
#define RE3PPS1                          BANKMASK(RE3PPS), 1
#define RE3PPS2                          BANKMASK(RE3PPS), 2
#define RE3PPS3                          BANKMASK(RE3PPS), 3
#define RE3PPS4                          BANKMASK(RE3PPS), 4
#define RE3PPS5                          BANKMASK(RE3PPS), 5
#define RE4                              BANKMASK(PORTE), 4
#define RE4PPS0                          BANKMASK(RE4PPS), 0
#define RE4PPS1                          BANKMASK(RE4PPS), 1
#define RE4PPS2                          BANKMASK(RE4PPS), 2
#define RE4PPS3                          BANKMASK(RE4PPS), 3
#define RE4PPS4                          BANKMASK(RE4PPS), 4
#define RE4PPS5                          BANKMASK(RE4PPS), 5
#define RE5                              BANKMASK(PORTE), 5
#define RE5PPS0                          BANKMASK(RE5PPS), 0
#define RE5PPS1                          BANKMASK(RE5PPS), 1
#define RE5PPS2                          BANKMASK(RE5PPS), 2
#define RE5PPS3                          BANKMASK(RE5PPS), 3
#define RE5PPS4                          BANKMASK(RE5PPS), 4
#define RE5PPS5                          BANKMASK(RE5PPS), 5
#define RE6                              BANKMASK(PORTE), 6
#define RE6PPS0                          BANKMASK(RE6PPS), 0
#define RE6PPS1                          BANKMASK(RE6PPS), 1
#define RE6PPS2                          BANKMASK(RE6PPS), 2
#define RE6PPS3                          BANKMASK(RE6PPS), 3
#define RE6PPS4                          BANKMASK(RE6PPS), 4
#define RE6PPS5                          BANKMASK(RE6PPS), 5
#define RE7                              BANKMASK(PORTE), 7
#define RE7PPS0                          BANKMASK(RE7PPS), 0
#define RE7PPS1                          BANKMASK(RE7PPS), 1
#define RE7PPS2                          BANKMASK(RE7PPS), 2
#define RE7PPS3                          BANKMASK(RE7PPS), 3
#define RE7PPS4                          BANKMASK(RE7PPS), 4
#define RE7PPS5                          BANKMASK(RE7PPS), 5
#define READ_WRITE                       BANKMASK(SSP1STAT), 2
#define READ_WRITE1                      BANKMASK(SSP1STAT), 2
#define REN                              BANKMASK(CWG1AS0), 6
#define REPEAT                           BANKMASK(SMT1CON1), 6
#define RES0                             BANKMASK(ADRESL), 0
#define RES1                             BANKMASK(ADRESL), 1
#define RES10                            BANKMASK(ADRESH), 2
#define RES11                            BANKMASK(ADRESH), 3
#define RES12                            BANKMASK(ADRESH), 4
#define RES13                            BANKMASK(ADRESH), 5
#define RES14                            BANKMASK(ADRESH), 6
#define RES15                            BANKMASK(ADRESH), 7
#define RES2                             BANKMASK(ADRESL), 2
#define RES3                             BANKMASK(ADRESL), 3
#define RES4                             BANKMASK(ADRESL), 4
#define RES5                             BANKMASK(ADRESL), 5
#define RES6                             BANKMASK(ADRESL), 6
#define RES7                             BANKMASK(ADRESL), 7
#define RES8                             BANKMASK(ADRESH), 0
#define RES9                             BANKMASK(ADRESH), 1
#define RF0                              BANKMASK(PORTF), 0
#define RF0PPS0                          BANKMASK(RF0PPS), 0
#define RF0PPS1                          BANKMASK(RF0PPS), 1
#define RF0PPS2                          BANKMASK(RF0PPS), 2
#define RF0PPS3                          BANKMASK(RF0PPS), 3
#define RF0PPS4                          BANKMASK(RF0PPS), 4
#define RF0PPS5                          BANKMASK(RF0PPS), 5
#define RF1                              BANKMASK(PORTF), 1
#define RF1PPS0                          BANKMASK(RF1PPS), 0
#define RF1PPS1                          BANKMASK(RF1PPS), 1
#define RF1PPS2                          BANKMASK(RF1PPS), 2
#define RF1PPS3                          BANKMASK(RF1PPS), 3
#define RF1PPS4                          BANKMASK(RF1PPS), 4
#define RF1PPS5                          BANKMASK(RF1PPS), 5
#define RF2                              BANKMASK(PORTF), 2
#define RF2PPS0                          BANKMASK(RF2PPS), 0
#define RF2PPS1                          BANKMASK(RF2PPS), 1
#define RF2PPS2                          BANKMASK(RF2PPS), 2
#define RF2PPS3                          BANKMASK(RF2PPS), 3
#define RF2PPS4                          BANKMASK(RF2PPS), 4
#define RF2PPS5                          BANKMASK(RF2PPS), 5
#define RF3                              BANKMASK(PORTF), 3
#define RF3PPS0                          BANKMASK(RF3PPS), 0
#define RF3PPS1                          BANKMASK(RF3PPS), 1
#define RF3PPS2                          BANKMASK(RF3PPS), 2
#define RF3PPS3                          BANKMASK(RF3PPS), 3
#define RF3PPS4                          BANKMASK(RF3PPS), 4
#define RF3PPS5                          BANKMASK(RF3PPS), 5
#define RF4                              BANKMASK(PORTF), 4
#define RF4PPS0                          BANKMASK(RF4PPS), 0
#define RF4PPS1                          BANKMASK(RF4PPS), 1
#define RF4PPS2                          BANKMASK(RF4PPS), 2
#define RF4PPS3                          BANKMASK(RF4PPS), 3
#define RF4PPS4                          BANKMASK(RF4PPS), 4
#define RF4PPS5                          BANKMASK(RF4PPS), 5
#define RF5                              BANKMASK(PORTF), 5
#define RF5PPS0                          BANKMASK(RF5PPS), 0
#define RF5PPS1                          BANKMASK(RF5PPS), 1
#define RF5PPS2                          BANKMASK(RF5PPS), 2
#define RF5PPS3                          BANKMASK(RF5PPS), 3
#define RF5PPS4                          BANKMASK(RF5PPS), 4
#define RF5PPS5                          BANKMASK(RF5PPS), 5
#define RF6                              BANKMASK(PORTF), 6
#define RF6PPS0                          BANKMASK(RF6PPS), 0
#define RF6PPS1                          BANKMASK(RF6PPS), 1
#define RF6PPS2                          BANKMASK(RF6PPS), 2
#define RF6PPS3                          BANKMASK(RF6PPS), 3
#define RF6PPS4                          BANKMASK(RF6PPS), 4
#define RF6PPS5                          BANKMASK(RF6PPS), 5
#define RF7                              BANKMASK(PORTF), 7
#define RF7PPS0                          BANKMASK(RF7PPS), 0
#define RF7PPS1                          BANKMASK(RF7PPS), 1
#define RF7PPS2                          BANKMASK(RF7PPS), 2
#define RF7PPS3                          BANKMASK(RF7PPS), 3
